In [2]:
#  install python locally
#  -	navigate to C:\Program Files\Python311\Scripts via File Explorer
#  -	replace the address with cmd to open Command Prompt into that directory
#  -	pip install jupyter
#  -	install all python libraries needed
#    e.g.
#      pip install pandas
#      pip install numpy
#      pip install scikit-learn
#      pip install matplotlib
#      pip install seaborn
#  -	from any folder, open cmd, then type jupyter notebook to open it
#  -	create a new folder (itâ€™ll be in the Python installation), then New > Python 3
#  -	add the folder to Quick Access

# =================================================

import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
# label index vs integer index

series_obj = Series(np.arange(8), index=['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8'])
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

In [4]:
series_obj['row 7']

6

In [5]:
series_obj[[0,7]]

row 1    0
row 8    7
dtype: int32

In [6]:
# create dataframe object
# note: passing in a seed e.g. 2, makes it return the same "random" results each time
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape((6,6)),
                   index=['row 1','row 2','row 3','row 4','row 5','row 6'],
                   columns=['column 1','column 2','column 3','column 4','column 5','column 6'])
DF_obj

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [7]:
# .iloc indexer
DF_obj.loc[['row 2', 'row 5'], ['column 5','column 2']]

       column 5  column 2
row 2  0.402366  0.437611
row 5  0.421004  0.559053

In [8]:
# slicing via 2 index values separated by colon : e.g. firstvalue : lastvalue
# indexer gets everything in between

# example retrieve all data between rows 3 and 7
DF_obj['row 3':'row 7']

       column 1  column 2  column 3  column 4  column 5  column 6
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [9]:
# compare with scalars
# scalar: refers to a single numerical value
# use comparison operators to get records based on operator

DF_obj < .2

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True     False      True
row 2     False     False     False     False     False      True
row 3     False     False      True     False     False     False
row 4     False     False     False     False     False     False
row 5     False     False      True     False     False     False
row 6     False     False     False     False     False     False

In [10]:
# filter with scalers

DF_obj[DF_obj > 0.9]

       column 1  column 2  column 3  column 4  column 5  column 6
row 1       NaN       NaN       NaN       NaN       NaN       NaN
row 2       NaN       NaN       NaN       NaN       NaN       NaN
row 3       NaN       NaN       NaN       NaN       NaN       NaN
row 4       NaN       NaN       NaN       NaN       NaN  0.997541
row 5       NaN       NaN       NaN       NaN       NaN       NaN
row 6       NaN  0.900274       NaN       NaN       NaN       NaN

In [11]:
# set value with scalars
# select all records with specified label index, then set their values to a scalar
# e.g. set value on row 5 to the value of 420

series_obj['row 5'] = 420
series_obj

row 1      0
row 2      1
row 3      2
row 4      3
row 5    420
row 6      5
row 7      6
row 8      7
dtype: int32

In [12]:
# handling missing values
# better to use approximation, rather than drop fields wioth missing values altogether

missing = np.nan

series_obj = Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6', missing, 'row 8'])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

In [13]:
# use isnull method

series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [14]:
# create a dataframe of random numbers

np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6,6))
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [15]:
# set certain coordinates in the dataframe to missing
# e.g. rows 3 to 5, at column 0

DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [16]:
# replace missing values with specified value using fillna method

filled_DF = DF_obj.fillna(0)
filled_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [18]:
# create a dictionary using { }
# 0: column index position 0 are being set to value 0.1
# for missing values in column 5 will be set to value 1.25

filled_DF = DF_obj.fillna({0: 0.1, 5: 1.25})
filled_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  1.250000
2  0.447031  0.585445  0.161985  0.520719  0.326051  1.250000
3  0.100000  0.836375  0.481343  0.516502  0.383048  1.250000
4  0.100000  0.559053  0.034450  0.719930  0.421004  1.250000
5  0.100000  0.900274  0.669612  0.456069  0.289804  0.525819

In [19]:
# pass in ffill method as an argument,
# it fills forward the last non-null value

fill_DF = DF_obj.fillna(method='ffill')
fill_DF

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

In [20]:
# count number of missing values to find more problematic variables

np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6,6))
DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [22]:
DF_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

In [23]:
# filter out missing values using dropna() method
# this removes the entire row if any of its variables have a value

DF_no_NaN = DF_obj.dropna()
DF_no_NaN

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

In [24]:
# remove entire column rather than the entire row
# pass argument axis = 1 to search the dataframe by column instead of row

DF_no_NaN = DF_obj.dropna(axis=1)
DF_no_NaN

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804

In [25]:
# remove duplicates to avoid skewed analysis
# e.g. repeat customer using different credit cards

DF_obj = DataFrame({'column 1':[1,1,2,2,3,3,3],
                    'column 2':['a','a','b','b','c','c','c'],
                    'column 3':['A','A','B','B','C','C','C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [26]:
# find duplicate rows based on previously assessed rows
# the first of a duplicate set is false because no dulpicates existed before

DF_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [27]:
# drop duplicates method for rows

DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [28]:
# drop duplicate rows based on column values

DF_obj = DataFrame({'column 1':[1,1,2,2,3,3,3],
                    'column 2':['a','a','b','b','c','c','c'],
                    'column 3':['A','A','B','B','C','D','C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [29]:
DF_obj.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

In [30]:
# np.arange(36) tells Python to generate a range from 0 to 35
# .reshape(6,6) generates 6 rows by 6 columns

DF_obj = pd.DataFrame(np.arange(36).reshape(6,6))
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [31]:
DF_obj_2 = pd.DataFrame(np.arange(15).reshape(5,3))
DF_obj_2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [32]:
# concatenating combines data from different sources into one table
# to join objects based on row index value,
# use concat method on sources to be joined then pass the axis = 1 argument
# this adds data as new columns

pd.concat([DF_obj, DF_obj_2], axis = 1 )

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [33]:
# to concatenate based on column index values, Python adds data as new rows

pd.concat([DF_obj, DF_obj_2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [34]:
# drop rows based on index
DF_obj.drop([0, 2])

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [35]:
# drop columns based on index, by passing axis = 1
DF_obj.drop([0, 2], axis = 1)

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

In [37]:
# creating a variable named added_variable, with new data
# to be joined with existing data source

series_obj = Series(np.arange(6))
series_obj.name = "added_variable"
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_variable, dtype: int32

In [38]:
# create a new variable named variable_added that combines both
# concatenate data using join method

variable_added = DataFrame.join(DF_obj, series_obj)
variable_added

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [39]:
# concatenate data using append method
# add a dataframe to itself
# ignore_index=False, prevents re-indexing the output i.e. retain original

# received warning for following output
added_datatable = variable_added.append(variable_added, ignore_index=False)
added_datatable

# "The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead."

C:\Users\Administrator\AppData\Local\Temp\2\ipykernel_4696\1993391547.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  added_datatable = variable_added.append(variable_added, ignore_index=False)

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [42]:
# using pandas.concat instead of pandas.append
added_datatable = pd.concat([variable_added, variable_added], ignore_index=False)
added_datatable

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [43]:
# how to regenerate index for appended data
# by setting ignore_index=True

added_datatable = pd.concat([variable_added, variable_added], ignore_index=True)
added_datatable

     0   1   2   3   4   5  added_variable
0    0   1   2   3   4   5               0
1    6   7   8   9  10  11               1
2   12  13  14  15  16  17               2
3   18  19  20  21  22  23               3
4   24  25  26  27  28  29               4
5   30  31  32  33  34  35               5
6    0   1   2   3   4   5               0
7    6   7   8   9  10  11               1
8   12  13  14  15  16  17               2
9   18  19  20  21  22  23               3
10  24  25  26  27  28  29               4
11  30  31  32  33  34  35               5

In [44]:
# sort data using sort values method
# e.g. sort by column index 5 descending

DF_sorted = DF_obj.sort_values(by=(5), ascending=[False])
DF_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

In [48]:
# grouping and data aggregation
# import an external dataset

# putting a spin on this exercise by pulling a file hosted on my GitHub
# instead of using the csv provided in the course
address = 'https://github.com/datamesse/data-visualisation-datasets/blob/main/International%20Marketplace%20sales/normalised%20flat%20files/FactSales.csv?raw=true'
sales = pd.read_csv(address)
sales.columns = ['OrderID','OrderLineID','CustomerID','CityID','ProductID','ShipMode','Quantity','DiscountPercentage','DiscountAmount','Sales','Profit','ProfitBin','OrderDate','ShipDate']

# retrieve first 5 rows by using head method
sales.head()

,OrderID,OrderLineID,CustomerID,CityID,ProductID,ShipMode,Quantity,DiscountPercentage,DiscountAmount,Sales,Profit,ProfitBin,OrderDate,ShipDate
0,11,1,23074,1644,939,Second Class,96,0.0,0.0,1728.0,1008.0,1000,1/01/2022,1/01/2022
1,11,2,23074,1644,1615,Second Class,4,0.0,0.0,960.0,520.0,400,1/01/2022,1/01/2022
2,40,3,23098,2528,956,Same Day,10,0.0,0.0,320.0,240.0,200,1/01/2022,1/01/2022
3,41,4,23101,2700,1081,Same Day,8,0.0,0.0,104.0,68.0,0,1/01/2022,1/01/2022
4,15,5,3409,55,1055,First Class,2,0.0,0.0,26.0,17.0,0,1/01/2022,1/01/2022

In [52]:
# drop columns that cannot be used in aggregation after group by e.g. IDs
sales_succinct = sales.drop(['OrderID','OrderLineID','CustomerID','CityID','ProductID','DiscountPercentage','ProfitBin','OrderDate','ShipDate'], axis = 1)

# group by values in a column
sales_groups = sales_succinct.groupby(sales_succinct['ShipMode'])

# aggregate numerical values
sales_groups.sum()

                Quantity  DiscountAmount         Sales       Profit
ShipMode
First Class       840837       273314.66  1.721247e+07   8321719.99
Same Day          756976       147572.83  1.454360e+07   7154127.80
Second Class     2479023       695353.15  4.943388e+07  24121173.16
Standard Class   4949883      1547816.29  1.001743e+08  48718670.31